ДО_для_разработки/src/Documents/РеализацияПоПроектам/РеализацияПоПроектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияПоПроектам</name>
  <comment>(ПБИ)</comment>
  <registerRecords>AccumulationRegister.РеализацииПоПроектам</registerRecords>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.пби_Сценарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.пби_СтатьиОборотов</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроектнаяЗадача</name>
      <type>
        <types>CatalogRef.ПроектныеЗадачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ДО_для_разработки/src/InformationRegisters/пби_Грейды/пби_Грейды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пби_Грейды</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.пби_Показатели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДО_для_разработки/src/InformationRegisters/ФактическиеТрудозатраты/ФактическиеТрудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФактическиеТрудозатраты</name>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьСверхурочно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьВВыходные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕжедневныйОтчет</name>
    <type>
      <types>DocumentRef.ЕжедневныйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРаботы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Контроль</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>DocumentRef.Отсутствие</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>DocumentRef.ЕжедневныйОтчет</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроектнаяЗадача</name>
    <type>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьОписаниеРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДобавления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДО_для_разработки/src/InformationRegisters/пби_ПоказателиДляРасчетов/пби_ПоказателиДляРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пби_ПоказателиДляРасчетов</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.пби_Показатели</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДО_для_разработки/src/AccumulationRegisters/РеализацииПоПроектам/РеализацииПоПроектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РеализацииПоПроектам</name>
  <comment>(ПБИ)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.пби_Сценарий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.пби_СтатьиОборотов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроектнаяЗадача</name>
    <type>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДО_для_разработки/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВДокументах</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенныеВебСерверы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВПереписке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВПерепискеСРангом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>105</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.ТерриторииИПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЯзыка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ДО_для_разработки/src/Documents/РеализацияПоПроектам/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.Период = НачалоМесяца(Объект.Период);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасходыНаСервере()
	
	СтатьяВзаиморасчетСОПП = Справочники.пби_СтатьиОборотов.НайтиПоКоду("000000015");
	СтатьяФОТ = Справочники.пби_СтатьиОборотов.НайтиПоКоду("000000022");
	СтатьяАдминистративныеРасходы = Справочники.пби_СтатьиОборотов.НайтиПоКоду("000000026");
	СтатьяРеализация = Справочники.пби_СтатьиОборотов.НайтиПоКоду("000000003");
	СтатьяКоличествоСотрудников = Справочники.пби_СтатьиОборотов.НайтиПоКоду("000000025");
	СтатьяЕСН = Справочники.пби_СтатьиОборотов.НайтиПоКоду("000000024");
	ПоказательСтавка = Справочники.пби_Показатели.НайтиПоКоду("000000007");
	ПоказательОклад = Справочники.пби_Показатели.НайтиПоКоду("000000008");
	ПоказательАдминистративныеРасходы = Справочники.пби_Показатели.НайтиПоКоду("000000002");
	ПоказательПроцентОПП = Справочники.пби_Показатели.НайтиПоКоду("000000004");
	ПоказательЕСН = Справочники.пби_Показатели.НайтиПоКоду("000000001"); 
	  
		
	ТЗ_Статьи = Объект.Проекты.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ_Статьи.Статья
	|ПОМЕСТИТЬ ТЗ_Статьи
	|ИЗ
	|	&ТЗ_Статьи КАК ТЗ_Статьи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	пби_ГрейдыСрезПоследних.Сотрудник,
	|	МАКСИМУМ(пби_ГрейдыСрезПоследних.Ставка) КАК Ставка,
	|	пби_ГрейдыСрезПоследних.Показатель
	|ПОМЕСТИТЬ Грейды
	|ИЗ
	|	РегистрСведений.пби_Грейды.СрезПоследних(&Период, ) КАК пби_ГрейдыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	пби_ГрейдыСрезПоследних.Сотрудник,
	|	пби_ГрейдыСрезПоследних.Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФактическиеТрудозатраты.Пользователь,
	|	СУММА(ФактическиеТрудозатраты.Длительность/3600) КАК Длительность
	|ПОМЕСТИТЬ РабочиеЧасы
	|ИЗ
	|	РегистрСведений.ФактическиеТрудозатраты КАК ФактическиеТрудозатраты
	|ГДЕ
	|	ФактическиеТрудозатраты.Подразделение = &Подразделение
	|	И ФактическиеТрудозатраты.ДатаДобавления >= &Период
	|	И ФактическиеТрудозатраты.ДатаДобавления <= КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактическиеТрудозатраты.Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	пби_ПоказателиДляРасчетовСрезПоследних.Показатель,
	|	пби_ПоказателиДляРасчетовСрезПоследних.Значение
	|ПОМЕСТИТЬ Показатели
	|ИЗ
	|	РегистрСведений.пби_ПоказателиДляРасчетов.СрезПоследних(&Период, ) КАК пби_ПоказателиДляРасчетовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацииПоПроектамОбороты.СуммаОборот
	|ПОМЕСТИТЬ СуммаРеализации
	|ИЗ
	|	РегистрНакопления.РеализацииПоПроектам.Обороты(
	|			&Период,
	|			КОНЕЦПЕРИОДА(&Период, МЕСЯЦ),
	|			Месяц,
	|			Сценарий = &Сценарий
	|				И Статья В ИЕРАРХИИ (&СтатьяРеализация)
	|				И Подразделение = &Подразделение) КАК РеализацииПоПроектамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Пользователи.Ссылка) КАК Количество,
	|	&СтатьяКоличествоСотрудников
	|ПОМЕСТИТЬ КоличествоСотрудников
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Подразделение = &Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА Грейды.Показатель = &ПоказательСтавка
	|				ТОГДА РабочиеЧасы.Длительность * Грейды.Ставка
	|			КОГДА Грейды.Показатель = &ПоказательОклад
	|				ТОГДА Грейды.Ставка
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	&СтатьяФОТ КАК Статья
	|ПОМЕСТИТЬ ФОТ
	|ИЗ
	|	РабочиеЧасы КАК РабочиеЧасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Грейды КАК Грейды
	|		ПО РабочиеЧасы.Пользователь = Грейды.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&СтатьяАдминистративныеРасходы,
	|	СУММА(КоличествоСотрудников.Количество * Показатели.Значение) КАК Сумма
	|ПОМЕСТИТЬ АдминистративныеРасходы
	|ИЗ
	|	КоличествоСотрудников КАК КоличествоСотрудников
	|		ПОЛНОЕ СОЕДИНЕНИЕ Показатели КАК Показатели
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Показатели.Показатель = &ПоказательАдминистративныеРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&СтатьяЕСН,
	|	СУММА(Показатели.Значение / 100 * ФОТ.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ЕСН
	|ИЗ
	|	ФОТ КАК ФОТ
	|		ПОЛНОЕ СОЕДИНЕНИЕ Показатели КАК Показатели
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Показатели.Показатель = &ПоказательЕСН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Показатели.Значение / 100 * СуммаРеализации.СуммаОборот КАК Сумма,
	|	&СтатьяВзаиморасчетСОПП
	|ПОМЕСТИТЬ ВзаиморасчетСОПП
	|ИЗ
	|	СуммаРеализации КАК СуммаРеализации
	|		ПОЛНОЕ СОЕДИНЕНИЕ Показатели КАК Показатели
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Показатели.Показатель = &ПоказательПроцентОПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(КоличествоСотрудников.Количество) КАК Сумма,
	|	КоличествоСотрудников.СтатьяКоличествоСотрудников КАК Статья,
	|	NULL КАК Проект,
	|	NULL КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ИтогВычислений
	|ИЗ
	|	КоличествоСотрудников КАК КоличествоСотрудников
	|
	|СГРУППИРОВАТЬ ПО
	|	КоличествоСотрудников.СтатьяКоличествоСотрудников
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(ФОТ.Сумма),
	|	ФОТ.Статья,
	|	NULL,
	|	NULL
	|ИЗ
	|	ФОТ КАК ФОТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ФОТ.Статья
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(АдминистративныеРасходы.Сумма),
	|	АдминистративныеРасходы.СтатьяАдминистративныеРасходы,
	|	NULL,
	|	NULL
	|ИЗ
	|	АдминистративныеРасходы КАК АдминистративныеРасходы
	|
	|СГРУППИРОВАТЬ ПО
	|	АдминистративныеРасходы.СтатьяАдминистративныеРасходы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(ВзаиморасчетСОПП.Сумма),
	|	ВзаиморасчетСОПП.СтатьяВзаиморасчетСОПП,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВзаиморасчетСОПП КАК ВзаиморасчетСОПП
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетСОПП.СтатьяВзаиморасчетСОПП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСН.Сумма,
	|	ЕСН.СтатьяЕСН,
	|	NULL,
	|	NULL
	|ИЗ
	|	ЕСН КАК ЕСН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ_Статьи.Статья,
	|	ИтогВычислений.Проект,
	|	ИтогВычислений.ПроектнаяЗадача,
	|	ИтогВычислений.Сумма
	|ИЗ
	|	ТЗ_Статьи КАК ТЗ_Статьи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогВычислений КАК ИтогВычислений
	|		ПО ТЗ_Статьи.Статья = ИтогВычислений.Статья";
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТЗ_Статьи", ТЗ_Статьи);
	Запрос.УстановитьПараметр("Период", Объект.Период);
	Запрос.УстановитьПараметр("Сценарий", Объект.Сценарий);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("СтатьяВзаиморасчетСОПП", СтатьяВзаиморасчетСОПП);
	Запрос.УстановитьПараметр("ПоказательАдминистративныеРасходы", ПоказательАдминистративныеРасходы);
	Запрос.УстановитьПараметр("СтатьяАдминистративныеРасходы", СтатьяАдминистративныеРасходы);
	Запрос.УстановитьПараметр("СтатьяРеализация", СтатьяРеализация);
	Запрос.УстановитьПараметр("СтатьяКоличествоСотрудников", СтатьяКоличествоСотрудников);
	Запрос.УстановитьПараметр("СтатьяЕСН",СтатьяЕСН);
	Запрос.УстановитьПараметр("ПоказательСтавка", ПоказательСтавка);
	Запрос.УстановитьПараметр("ПоказательОклад", ПоказательОклад);
	Запрос.УстановитьПараметр("ПоказательПроцентОПП", ПоказательПроцентОПП);
	Запрос.УстановитьПараметр("ПоказательЕСН", ПоказательЕСН);
	Запрос.УстановитьПараметр("СтатьяФОТ", СтатьяФОТ);    	
	РезультатЗапроса = Запрос.Выполнить();
	Рез = РезультатЗапроса.Выгрузить();
	Объект.Проекты.Загрузить(Рез);
			
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасходы(Команда)
	Если Объект.Проекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьРасходыНаСервере(); 	
		
КонецПроцедуры
